#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```


Warning: Deprecated Resource

  with module.superfluid_ecs_task.data.aws_subnet_ids.superfluid,
  on modules/ecs-task/service.tf line 23, in data "aws_subnet_ids" "superfluid":
  23: data "aws_subnet_ids" "superfluid" {

The aws_subnet_ids data source has been deprecated and will be removed in a
future version. Use the aws_subnets data source instead.
Success! The configuration is valid, but there were some validation warnings
as shown above.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.superfluid_ecs.random_string.cluster: Refreshing state... [id=VMKK8W4T]
module.superfluid_ecs.data.aws_availability_zones.available_zones: Reading...
module.superfluid_vpc.aws_vpc.superfluid_ecs_vpc: Refreshing state... [id=vpc-0a99abab097b1a460]
module.superfluid_ecs.aws_ecs_cluster.superfluid_ecs_cluster_main: Refreshing state... [id=arn:aws:ecs:us-east-1:717870463034:cluster/superfluid-sentinel-production-VMKK8W4T]
module.superfluid_ecs.data.aws_availability_zones.available_zones: Read complete after 0s [id=us-east-1]
module.superfluid_ecs.aws_internet_gateway.gateway: Refreshing state... [id=igw-08c71b1f4c263db12]
module.superfluid_ecs.aws_subnet.public[1]: Refreshing state... [id=subnet-0440b5e2d43bd21e6]
module.superfluid_ecs.aws_subnet.private[0]: Refreshing state... [id=subnet-0545860484ee9aff3]
module.superfluid_ecs.aws_subnet.public[0]: Refreshing state... [id=subnet-09e0182aabf4e7b8b]
module.superfluid_ecs.aws_subnet.private[1]: Refreshing state... [id=subnet-0599813eb5a731026]
module.superfluid_ecs.aws_eip.gateway[1]: Refreshing state... [id=eipalloc-0494285b6d4d34a2f]
module.superfluid_ecs.aws_eip.gateway[0]: Refreshing state... [id=eipalloc-0cfabf6e2d6872eed]
module.superfluid_ecs.aws_route.internet_access: Refreshing state... [id=r-rtb-04cc5d6ce55673a451080289494]
module.superfluid_ecs.aws_nat_gateway.gateway[0]: Refreshing state... [id=nat-02f5d31f5a49a5055]
module.superfluid_ecs.aws_nat_gateway.gateway[1]: Refreshing state... [id=nat-0ef431d6c191528a6]
module.superfluid_ecs.aws_route_table.private[1]: Refreshing state... [id=rtb-076220b2825daa9f3]
module.superfluid_ecs.aws_route_table.private[0]: Refreshing state... [id=rtb-0cb2a9193f92fffa8]
module.superfluid_ecs.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0ccf1359e5de66c86]
module.superfluid_ecs.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-05dd46a2637b0a800]
module.superfluid_ecs_task.data.aws_secretsmanager_secret_version.superfluid_sentinel_secrets: Reading...
module.superfluid_ecs_task.module.ecs_task_execution_role.data.aws_region.current: Reading...
module.superfluid_ecs_task.data.aws_subnet_ids.superfluid: Reading...
module.superfluid_ecs_task.module.ecs_task_execution_role.data.aws_partition.current: Reading...
module.superfluid_ecs_task.module.ecs_task_execution_role.data.aws_iam_policy_document.assume_role_policy: Reading...
module.superfluid_ecs_task.module.ecs_task_execution_role.data.aws_partition.current: Read complete after 0s [id=aws]
module.superfluid_ecs_task.module.ecs_task_execution_role.data.aws_caller_identity.current: Reading...
module.superfluid_ecs_task.module.cloudwatch_kms_key.data.aws_caller_identity.current: Reading...
module.superfluid_ecs_task.module.superfluid_sentinel_task_sg.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-04e3d1faf9e19f014]
module.superfluid_ecs_task.module.cloudwatch_kms_key.data.aws_region.current: Reading...
module.superfluid_ecs_task.module.ecs_task_execution_role.data.aws_iam_policy_document.assume_role_policy: Read complete after 0s [id=320642683]
module.superfluid_ecs_task.module.ecs_task_execution_role.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.superfluid_ecs_task.module.cloudwatch_kms_key.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.superfluid_ecs_task.module.cloudwatch_kms_key.data.aws_partition.current: Reading...
module.superfluid_ecs_task.module.cloudwatch_kms_key.data.aws_partition.current: Read complete after 0s [id=aws]
module.superfluid_ecs_task.module.ecs_task_execution_role.aws_iam_role.main: Refreshing state... [id=app-superfluid-sentinel-task-execution-role]
module.superfluid_ecs_task.module.superfluid_sentinel_task_sg.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-2069494171]
module.superfluid_ecs_task.module.superfluid_sentinel_task_sg.aws_security_group_rule.ingress_rules[0]: Refreshing state... [id=sgrule-1521642401]
module.superfluid_ecs_task.module.superfluid_sentinel_task_sg.aws_security_group_rule.ingress_rules[1]: Refreshing state... [id=sgrule-3412004152]
module.superfluid_ecs_task.data.aws_subnet_ids.superfluid: Read complete after 0s [id=vpc-0a99abab097b1a460]
module.superfluid_ecs_task.module.cloudwatch_kms_key.data.aws_caller_identity.current: Read complete after 0s [id=717870463034]
module.superfluid_ecs_task.module.cloudwatch_kms_key.data.aws_iam_policy_document.cloudwatch: Reading...
module.superfluid_ecs_task.module.cloudwatch_kms_key.data.aws_iam_policy_document.cloudwatch: Read complete after 0s [id=2223216774]
module.superfluid_ecs_task.module.cloudwatch_kms_key.aws_kms_key.cloudwatch: Refreshing state... [id=421d947a-68a0-47b1-9048-67eff02bed3a]
module.superfluid_ecs_task.module.ecs_task_execution_role.data.aws_caller_identity.current: Read complete after 0s [id=717870463034]
module.superfluid_ecs_task.data.aws_secretsmanager_secret_version.superfluid_sentinel_secrets: Read complete after 0s [id=superfluid/sentinel|AWSCURRENT]
module.superfluid_ecs_task.aws_cloudwatch_log_group.main: Refreshing state... [id=/aws/ecs/superfluid-sentinel]
module.superfluid_ecs_task.module.cloudwatch_kms_key.aws_kms_alias.cloudwatch: Refreshing state... [id=alias/superfluid-sentinel-cloudwatch-logs]
module.superfluid_ecs_task.module.ecs_task_execution_role.data.aws_iam_policy_document.main: Reading...
module.superfluid_ecs_task.module.ecs_task_execution_role.data.aws_iam_policy_document.main: Read complete after 0s [id=756167102]
module.superfluid_ecs_task.module.ecs_task_execution_role.aws_iam_policy.main: Refreshing state... [id=arn:aws:iam::717870463034:policy/app-superfluid-sentinel-task-execution-role-policy]
module.superfluid_ecs_task.aws_ecs_task_definition.superfluid_sentinel: Refreshing state... [id=superfluid-sentinel-definition]
module.superfluid_ecs_task.aws_ecs_service.superfluid_sentinel_service: Refreshing state... [id=arn:aws:ecs:us-east-1:717870463034:service/superfluid-sentinel-production-VMKK8W4T/superfluid-sentinel-svc]
module.superfluid_ecs_task.module.ecs_task_execution_role.aws_iam_role_policy_attachment.main: Refreshing state... [id=app-superfluid-sentinel-task-execution-role-20230125005754524800000005]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.superfluid_ecs_task.module.superfluid_sentinel_task_sg.aws_security_group.this_name_prefix[0] has changed
  ~ resource "aws_security_group" "this_name_prefix" {
      ~ egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "All protocols"
              + from_port        = 0
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
        id                     = "sg-04e3d1faf9e19f014"
      ~ ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "HTTP"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "HTTPS"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
        name                   = "superfluid-sentinel-task-sg-20230125005739204300000003"
        tags                   = {
            "Name" = "superfluid-sentinel-task-sg"
        }
        # (7 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.superfluid_ecs_task.aws_cloudwatch_metric_alarm.ecs_task_running will be created
  + resource "aws_cloudwatch_metric_alarm" "ecs_task_running" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Superfluid ECS CloudWatch Alarm to have sure that we have at minimum 1 Running task into the cluster"
      + alarm_name                            = "superfluid-sentinel-ecs-task-running-alarm"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "missing"

      + metric_query {
          + id          = "TaskRunning"
          + return_data = false

          + metric {
              + dimensions  = {
                  + "ClusterName" = "superfluid-sentinel-production-VMKK8W4T"
                }
              + metric_name = "TaskRunning"
              + namespace   = "AWS/ECS"
              + period      = 15
              + stat        = "SampleCount"
            }
        }
    }

  # module.superfluid_ecs_task.aws_sns_topic.superfluid_principal will be created
  + resource "aws_sns_topic" "superfluid_principal" {
      + arn                         = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "superfluid-sentinel-notification"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + tags                        = {
          + "ClusterName" = "superfluid-sentinel-production-VMKK8W4T"
        }
      + tags_all                    = {
          + "ClusterName" = "superfluid-sentinel-production-VMKK8W4T"
        }
    }

  # module.superfluid_ecs_task.aws_sns_topic_subscription.superfluid_principal_email will be created
  + resource "aws_sns_topic_subscription" "superfluid_principal_email" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "gabriel.bragavera@gmail.com"
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "email"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Warning: Deprecated Resource

  with module.superfluid_ecs_task.data.aws_subnet_ids.superfluid,
  on modules/ecs-task/service.tf line 23, in data "aws_subnet_ids" "superfluid":
  23: data "aws_subnet_ids" "superfluid" {

The aws_subnet_ids data source has been deprecated and will be removed in a
future version. Use the aws_subnets data source instead.

(and one more similar warning elsewhere)

Warning: Argument is deprecated

  with module.superfluid_ecs.aws_ecs_cluster.superfluid_ecs_cluster_main,
  on modules/ecs/main.tf line 21, in resource "aws_ecs_cluster" "superfluid_ecs_cluster_main":
  21: resource "aws_ecs_cluster" "superfluid_ecs_cluster_main" {

Use the aws_ecs_cluster_capacity_providers resource instead

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @kevencript, Action: `pull_request`*